src/testsuite_old/sysbench/results/oltp_point_select.lua_threads128/run.perf.log
sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 128
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 128 tps: 411618.45 qps: 411618.45 (r/w/o: 411618.45/0.00/0.00) lat (ms,95%): 0.46 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 426333.12 qps: 426333.12 (r/w/o: 426333.12/0.00/0.00) lat (ms,95%): 0.46 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            25200915
        write:                           0
        other:                           0
        total:                           25200915
    transactions:                        25200913 (420136.14 per sec.)
    queries:                             25200915 (420136.17 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      420136.1394
    time elapsed:                        60.0118s
    total number of events:              25200913

Latency (ms):
         min:                                    0.07
         avg:                                    0.30
         max:                                   92.48
         95th percentile:                        0.46
         sum:                              7648853.68

Threads fairness:
    events (avg/stddev):           196878.1094/20968.96
    execution time (avg/stddev):   59.7567/0.03

sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 128
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 128 tps: 448501.74 qps: 448501.74 (r/w/o: 448501.74/0.00/0.00) lat (ms,95%): 0.42 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 458709.86 qps: 458709.86 (r/w/o: 458709.86/0.00/0.00) lat (ms,95%): 0.42 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            27283713
        write:                           0
        other:                           0
        total:                           27283713
    transactions:                        27283714 (454799.80 per sec.)
    queries:                             27283713 (454799.78 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      454799.8010
    time elapsed:                        60.0100s
    total number of events:              27283714

Latency (ms):
         min:                                    0.07
         avg:                                    0.28
         max:                                   52.05
         95th percentile:                        0.42
         sum:                              7649292.09

Threads fairness:
    events (avg/stddev):           213149.5859/40101.70
    execution time (avg/stddev):   59.7601/0.06